[UNK]	0
<s>	0
</s>	0
[CLS]	0
[SEP]	0
[MASK]	0
AT	-0
AG	-1
CT	-2
AA	-3
TG	-4
NN	-5
AC	-6
ATT	-7
TT	-8
CC	-9
CTG	-10
ATG	-11
AGG	-12
CTT	-13
NNNN	-14
AAG	-15
CAG	-16
AAT	-17
TGG	-18
NNNNNNNN	-19
CTC	-20
CAA	-21
CAC	-22
CG	-23
CTGG	-24
ACT	-25
ATTT	-26
TTT	-27
CAT	-28
AGT	-29
TGT	-30
AAAA	-31
ATGG	-32
CCT	-33
GG	-34
CTTT	-35
AATT	-36
NNNNNNNNNNNNNNNN	-37
AAGG	-38
AATG	-39
CAGG	-40
AAAT	-41
ACTG	-42
AAAG	-43
ACTT	-44
ACC	-45
CTGT	-46
TTTT	-47
ACAG	-48
ATGT	-49
CATT	-50
AGGG	-51
CTCC	-52
CAAG	-53
TGAG	-54
ATAT	-55
AAAC	-56
TGGG	-57
CCAG	-58
CTTG	-59
CCTT	-60
CTGGG	-61
CCTG	-62
CATG	-63
CGG	-64
AAGT	-65
ATTG	-66
ATTTT	-67
AGAG	-68
TGTT	-69
AGGT	-70
CAGT	-71
ACAT	-72
TGTG	-73
CTCT	-74
AAAAT	-75
CAAT	-76
AGTT	-77
ACAC	-78
CCG	-79
ACTC	-80
CCAT	-81
AATTT	-82
CCTC	-83
CCAC	-84
AATGG	-85
CTTTT	-86
CACT	-87
CTAG	-88
ATAG	-89
AAAAG	-90
TGGT	-91
CTAT	-92
ACG	-93
AGTG	-94
AACC	-95
AAATT	-96
AAATG	-97
GGG	-98
CCCC	-99
AGAT	-100
CCTGG	-101
TGAT	-102
CCCAG	-103
CTCAG	-104
CATGG	-105
CATTT	-106
ACTTT	-107
AGAA	-108
CTCTG	-109
CTAC	-110
TGAA	-111
CCAGG	-112
ACTGG	-113
ATAC	-114
CGT	-115
TGCC	-116
AATGT	-117
AAGGG	-118
CTAA	-119
CTCTT	-120
CCTCC	-121
ATTTTT	-122
ACAGG	-123
ATAA	-124
ACAA	-125
AGCC	-126
CACTT	-127
CACTG	-128
CAGGG	-129
CTTGG	-130
CCAA	-131
AATTTT	-132
CCTTT	-133
AGAC	-134
ATGTT	-135
AATAT	-136
ATTTG	-137
CACC	-138
ATGGG	-139
CTTTG	-140
AAAGG	-141
CTGTT	-142
CAGAG	-143
CAAGG	-144
TGGGG	-145
CACG	-146
CCTGT	-147
ATCC	-148
ATATT	-149
CAAAA	-150
AAGAG	-151
TGTTT	-152
AAGTT	-153
CAATT	-154
CTGAG	-155
AGGGG	-156
ACTGT	-157
CACAG	-158
CGGG	-159
CTGGT	-160
CTCG	-161
CTATT	-162
CAAAG	-163
CTGTG	-164
CAGTT	-165
CAATG	-166
CTTCC	-167
CAAAT	-168
ATGTG	-169
AAAGT	-170
ATGGT	-171
ACATT	-172
AGAAT	-173
CTTGT	-174
CCTGGG	-175
AAGGT	-176
ATAAT	-177
CATGT	-178
TGAC	-179
AAACT	-180
CAAGT	-181
AACAG	-182
CTGAGG	-183
CTTTTT	-184
AACAA	-185
CTAGG	-186
TGCAG	-187
CTGCC	-188
AAAAAAAA	-189
ATTAT	-190
AACAT	-191
AGTTT	-192
TGGTT	-193
CTATG	-194
CTAAG	-195
CTAAT	-196
CAGGT	-197
AAAAAT	-198
CTCCTG	-199
TGAGG	-200
AGAAG	-201
CACAC	-202
AGGGT	-203
TTTTTT	-204
AACTT	-205
CTCAT	-206
CATAT	-207
GGT	-208
CATTTT	-209
TGTGG	-210
AGTAG	-211
CTACT	-212
ACATG	-213
AAAATT	-214
CCATT	-215
ACCAG	-216
AGAGG	-217
CCTCAG	-218
CACAT	-219
CCAAG	-220
AAAATG	-221
AATTG	-222
AAATAT	-223
CTCTC	-224
TGGGT	-225
AATAG	-226
ACAAG	-227
CCATG	-228
ATATG	-229
AACTG	-230
CCCTG	-231
TGGAG	-232
CATTG	-233
CCTTG	-234
ACTTTT	-235
AGGTT	-236
▁G	-237
AAGTG	-238
AGGAG	-239
AACT	-240
CAGTG	-241
ATTAG	-242
ACGG	-243
TGTTG	-244
ATCTT	-245
TGGGAGG	-246
ACAGT	-247
ACAAT	-248
ATGAG	-249
TGGTG	-250
▁T	-251
ACAGAG	-252
AAATTT	-253
CGCC	-254
AAAAAG	-255
CCGT	-256
AAGAT	-257
ACTTG	-258
CAGAT	-259
TGTAT	-260
TTTTG	-261
CATAG	-262
CTCTGT	-263
ATTCC	-264
CTCTTT	-265
AACAC	-266
CTTAT	-267
CGTT	-268
ACCTG	-269
ACTGGG	-270
CACTC	-271
AGTTG	-272
CTGGGG	-273
ACAAAA	-274
ACCAA	-275
CTCAGG	-276
ATGAT	-277
CAGCC	-278
AATGGG	-279
AAAAGG	-280
CTTAG	-281
ACCAC	-282
ACCAT	-283
CTAGT	-284
CCTTTT	-285
ACGT	-286
AAGCC	-287
CTGAT	-288
TTTTTTTT	-289
TGGAT	-290
CGTG	-291
ACTAT	-292
CCCAC	-293
ACCTT	-294
ATTACAGG	-295
TGTAG	-296
CTAATT	-297
CAGTGG	-298
AGTAT	-299
CCCAA	-300
CCCTT	-301
AAACC	-302
CCTAG	-303
ACATTT	-304
TTTG	-305
CTATTT	-306
CCACC	-307
AGGTG	-308
ACTAG	-309
CAAAAT	-310
AATCCCAG	-311
ATGGGG	-312
AACTC	-313
CCCAT	-314
AAATGT	-315
CTGTTT	-316
AAAGAG	-317
CTCACTG	-318
ACCT	-319
CGAG	-320
TGATT	-321
ATGTTT	-322
AATGTT	-323
ATTATT	-324
CCTCTG	-325
AAAGTT	-326
AAGAA	-327
CTCTCC	-328
CCAGT	-329
ATTTTG	-330
AGGAT	-331
CCGG	-332
ATTTTTT	-333
CAATTT	-334
AATAAT	-335
CAAAAG	-336
CTCGG	-337
CTGCAG	-338
AGGAGG	-339
CCTAT	-340
ACACT	-341
CAATGG	-342
CTCATG	-343
TGTGT	-344
CATCC	-345
ATATAT	-346
AAATGG	-347
TGAAT	-348
CTCAAG	-349
AAACTT	-350
CTAAAA	-351
AAAAGT	-352
CTCTGG	-353
TGAAG	-354
CCCAGG	-355
CTCAC	-356
ATTTAT	-357
CTTCTT	-358
AAACTG	-359
AATATT	-360
CTTGAG	-361
CACTGG	-362
AGCAG	-363
AAACAG	-364
TGTTTT	-365
CACTTT	-366
ACTCC	-367
ATTGTT	-368
CTTCTG	-369
CTACC	-370
CAAAGTG	-371
CTCTTG	-372
TGCTG	-373
TGATG	-374
CTTTGT	-375
CTGGGATTACAGG	-376
TGGTGG	-377
CAAATG	-378
AATTTTT	-379
AACCT	-380
AGATG	-381
ATTGT	-382
AAGGGG	-383
CAAAC	-384
CAGAAG	-385
CCAAT	-386
CCACTG	-387
TGCTT	-388
CAGTTT	-389
TTTTT	-390
AGATT	-391
CAAATT	-392
CAAAGG	-393
CTACTC	-394
ACTAAAA	-395
ATCTG	-396
AACG	-397
CTGGGT	-398
ATAAG	-399
CGGT	-400
CTTTTTT	-401
AGTAGAG	-402
CAGAGG	-403
AACATT	-404
CCTTGG	-405
AAAAAAT	-406
CCCG	-407
CAGGGG	-408
ATCAT	-409
ACACAG	-410
TGGGGG	-411
CTCCTT	-412
AAGTTT	-413
CTGGAGTG	-414
GT	-415
CACTCCAG	-416
ATTTGT	-417
CAGGAG	-418
ATCAC	-419
CTCACT	-420
CGGGG	-421
CAGGTT	-422
AAAAATT	-423
AGGAAG	-424
AATGGT	-425
CTTGGG	-426
CTTGTT	-427
CTCATT	-428
CTGTGT	-429
CTAAAT	-430
AATCC	-431
CTTTTG	-432
CTCAA	-433
ATGCC	-434
CATGTT	-435
CTCAGT	-436
ATCAG	-437
AGCTG	-438
ACAAAT	-439
AGGCAG	-440
ACATAT	-441
AATTTG	-442
ACAAAG	-443
AAAGGG	-444
AAGAAG	-445
CTGTGG	-446
ACCCAG	-447
ATTGG	-448
CCACT	-449
ATTTGG	-450
CAAGGG	-451
ATATTT	-452
ACAGTT	-453
CTTCAG	-454
CTTTGG	-455
CTCCAG	-456
CTTCAT	-457
CACGG	-458
AGGCC	-459
ACAGGG	-460
CACCTG	-461
CTACTT	-462
CAAAGT	-463
ACCCC	-464
AACTTT	-465
CACTGT	-466
AAGAAT	-467
CACTTTGGGAGG	-468
TGTATTTTT	-469
CACCAC	-470
TGTTTTT	-471
ACCTC	-472
CTAAAG	-473
AAATAG	-474
CATGGG	-475
ACCCT	-476
CTGGTT	-477
CAACC	-478
CGAT	-479
CACATG	-480
ATTCTT	-481
CAACAG	-482
AGTGG	-483
CTGAAG	-484
CCTGTAATCCCAG	-485
ATAAAA	-486
CTAGAG	-487
CTATAT	-488
AGTCC	-489
ACACC	-490
CCTCCCAAAGTG	-491
ACTGTT	-492
CTCCG	-493
CATTTTT	-494
CTACAG	-495
AGAAAA	-496
CAACCT	-497
CTAATG	-498
AAACG	-499
TGAGT	-500
ATGGTT	-501
CTATTG	-502
ACCG	-503
TGCAT	-504
CTATGT	-505
ATGAAG	-506
GGGT	-507
TGTCC	-508
CTGGAG	-509
CAATGT	-510
CAGCAG	-511
CAAGTT	-512
AGGTGG	-513
ATGTGT	-514
CCTGTT	-515
AATTAT	-516
TGTGTGTG	-517
CTGCTG	-518
AAACAT	-519
CAACAT	-520
AACATG	-521
ACACACAC	-522
TGGTTT	-523
ACCATG	-524
AATTAG	-525
AAAAAAG	-526
TGGCTC	-527
CTACTG	-528
CCTCCTG	-529
CACAGG	-530
CCAAGG	-531
TGTATT	-532
CCACG	-533
ACATGG	-534
AACAAT	-535
CAACAA	-536
CCTCTT	-537
ATTCAT	-538
CTAAGG	-539
TGGCC	-540
TGAGTT	-541
CTAATTTT	-542
CCAGAG	-543
CCAGTT	-544
AGGTCAGG	-545
ATAGT	-546
CAAGAG	-547
ATGAAT	-548
AAACACT	-549
AGGTTT	-550
ATTCTG	-551
ATTAAT	-552
AAATTTT	-553
CTAGTT	-554
ACACAT	-555
CTCTACTAAAA	-556
AAGGAG	-557
ACAATT	-558
AAAATTT	-559
CAGGGT	-560
AAAGTG	-561
CATGGT	-562
AACAGG	-563
ACAGAAG	-564
AGGGAG	-565
AATCTG	-566
ATATATAT	-567
AATGAG	-568
CTTTAT	-569
ATGCAG	-570
CTCAAT	-571
AAGTGG	-572
CTTCCT	-573
ACTTTTT	-574
ATGTTGG	-575
ACTTGG	-576
ATGTGG	-577
CACGT	-578
ATGGGT	-579
TGAAACC	-580
ACTCAG	-581
CTTTCC	-582
CTGCAT	-583
CTCTTTT	-584
AAGGTT	-585
ACAGAGT	-586
ACTGGT	-587
CACAAT	-588
ATTTTTTT	-589
CTTGGT	-590
AAATTG	-591
AAGAGG	-592
ACACTG	-593
TTTTTTT	-594
AACAAG	-595
CAGGCTGGAGTG	-596
CCTGAG	-597
CTGAGGCAGG	-598
CCTAGG	-599
CATTTG	-600
ATAGG	-601
CATCAT	-602
TGCAGTGAG	-603
ACAAAC	-604
CACTCCAGCCTGGG	-605
CTCCTGCCTCAG	-606
ATGAGG	-607
CCTCG	-608
ATCAA	-609
ACAATG	-610
CACTTG	-611
CAAGGT	-612
CTTATT	-613
CCTGGT	-614
▁TT	-615
CACATT	-616
CAGAAT	-617
CATGAG	-618
ACAAGG	-619
AAGGGT	-620
AAATGTT	-621
ATGTAT	-622
AAAAATG	-623
ACTCTG	-624
CCCCT	-625
AAAATAT	-626
ATTTAG	-627
CATCTG	-628
CTAAGT	-629
TGTGAG	-630
CCGGG	-631
ACACTT	-632
AAATAAT	-633
ATTTCTT	-634
ATGGAG	-635
CCTTTG	-636
ACCATT	-637
CATATT	-638
AAAGAT	-639
ACCTGG	-640
ATACAAAA	-641
AAGCAG	-642
ACACG	-643
TGTTGG	-644
TGAGAG	-645
TGGGAG	-646
CTTAAT	-647
CACAGT	-648
CTATTTT	-649
ACATGT	-650
ATGATT	-651
ACATTG	-652
CTACAT	-653
AAATATT	-654
ATTTATTT	-655
TGTTGT	-656
AAAGGT	-657
CTGGGTT	-658
CGTGG	-659
AAGAAAA	-660
AGGGTT	-661
AGTCCCAG	-662
ATTTCC	-663
CTATGG	-664
CATCTT	-665
AACCAG	-666
TGGGTT	-667
CGTGAG	-668
CAAACT	-669
CTCAAAA	-670
AATGTG	-671
AAGATG	-672
CCGAGG	-673
ACATTTT	-674
AGAGT	-675
CTGAAT	-676
CTGCTT	-677
TTTAT	-678
AAATAAAT	-679
CCTTGT	-680
AAAATGT	-681
AACTGG	-682
AACTTG	-683
TGTGTG	-684
CACCAT	-685
ACCTCC	-686
AAAATGG	-687
CAACTC	-688
ATGTTG	-689
CCCTCC	-690
CAGAGT	-691
ACTATT	-692
CTCAAAAAAAA	-693
ATTTATT	-694
CCCTTT	-695
AACTGT	-696
AAACTC	-697
TGGGGT	-698
CTATAG	-699
TGTCTT	-700
AACTCC	-701
TGTATTTTTAGTAGAG	-702
CATTCTCAG	-703
ACCTTT	-704
ACTACAGG	-705
CTTGTG	-706
AATATG	-707
AAAACC	-708
CTAGGG	-709
ACTCTGT	-710
CCCGG	-711
AAAAAGG	-712
ACTCTT	-713
CATCAG	-714
CATGTG	-715
CGCG	-716
TGTTTG	-717
AGGTTG	-718
CAATTTT	-719
CCCTGG	-720
CACAAG	-721
CTGAGT	-722
CCTCGG	-723
ATAAAG	-724
CTAAAC	-725
CACCAG	-726
CCCCAG	-727
AGGTTGCAGTGAG	-728
TGGAAAC	-729
CGATT	-730
ACTTTG	-731
CCAGGG	-732
TGGAAG	-733
AACAGT	-734
ATGATG	-735
CA	-736
AGCAT	-737
AAAAGTT	-738
ACTAAT	-739
CCTTTTT	-740
▁GG	-741
CCACAG	-742
CGTTT	-743
CTCCAT	-744
CGAGAC	-745
AAGATT	-746
ACCTTG	-747
AAAAAGT	-748
AATTGT	-749
CATTGT	-750
CTTCTTT	-751
CAGATG	-752
AGAAAG	-753
ACCAGG	-754
CAAAAAT	-755
CGAGG	-756
ACCCTG	-757
CTCGT	-758
AGTTTG	-759
CAGATT	-760
CAGCTG	-761
CTTTGTG	-762
CTGTTG	-763
CCCTC	-764
CCATTT	-765
TGGAGG	-766
AGAGTT	-767
CCTGTG	-768
CTAATTT	-769
ATAAAT	-770
AGTTTT	-771
AGCTT	-772
AAGCAA	-773
CTGTTTT	-774
ATTGTG	-775
CAATAT	-776
CCTGGCCAA	-777
CATAAT	-778
CAGGAGG	-779
ATGTTTT	-780
AGTATT	-781
ATGTGTG	-782
AACCTT	-783
AACCTG	-784
ACTGAG	-785
ATCTC	-786
CTTCAA	-787
CAAGTGG	-788
AATAAG	-789
AGGGGG	-790
ACTTGT	-791
ACGGGG	-792
TTTTTTTTT	-793
ATAATT	-794
CTGATG	-795
CATATG	-796
AATGTTT	-797
ACCAAG	-798
CTTCAC	-799
ATGGTG	-800
CTGAC	-801
AAGTAG	-802
CTAAAAT	-803
CTCCTC	-804
AGGAAT	-805
CTAGGT	-806
AGAGAG	-807
ACTGTG	-808
ACCAAT	-809
CTGATT	-810
CAGTGAG	-811
AGTAGCTGGG	-812
ATCCT	-813
CACCG	-814
ACCTGT	-815
AAGTGT	-816
CTTGAA	-817
CAGTGT	-818
CAGGTG	-819
CCTTCC	-820
ACAGTG	-821
CTTTCTT	-822
ATCG	-823
AGGGGT	-824
ATTTTGT	-825
CAACTT	-826
AGTAAT	-827
AGTGT	-828
CAAAATG	-829
AAAGAAG	-830
ACGTT	-831
AAGTTG	-832
AAAAAAAT	-833
CCCATT	-834
ATACT	-835
ACCCAC	-836
AGTTTTT	-837
AAAACAG	-838
CCTCCCG	-839
CAAAAAG	-840
AACTAG	-841
TGGAAT	-842
CCAAAG	-843
CCGAG	-844
CCAGGCTGGT	-845
ATCTTT	-846
CCAAAT	-847
ACAGGT	-848
ATTCAG	-849
CTTTTTTT	-850
CTCCTGAC	-851
AACCAT	-852
AAGAGT	-853
CATGGTGG	-854
AACATTT	-855
AACTAT	-856
CTGAGGCAGGAGAAT	-857
GGGAGG	-858
CCTCCAG	-859
CTGGTG	-860
ACTCG	-861
ACTATG	-862
AGAAAT	-863
CTTCCTT	-864
AATCAT	-865
CCTATT	-866
AGGTCAGGAGTT	-867
AAAGAAAG	-868
AGTTGG	-869
CTTTAG	-870
ACAAGT	-871
AATTATT	-872
CTCTGGG	-873
CTGGAGG	-874
CTGTAG	-875
CATCAC	-876
GGGG	-877
TGGCTT	-878
CATGAT	-879
CACTTTT	-880
AATAAAA	-881
ATGGAGT	-882
TGCCCAGG	-883
AGGGAGG	-884
AATGAT	-885
ATATTG	-886
CTCCTCC	-887
CAGCTT	-888
CTGCCT	-889
CACCTGT	-890
ATTAAG	-891
CAAAATT	-892
CAAGTAG	-893
ATTATTT	-894
AAGGTG	-895
CCAAAA	-896
CACAGAG	-897
AACACT	-898
CCACCG	-899
CAGCAT	-900
CCAGTG	-901
ATGCTG	-902
AGTTGT	-903
CTTTCTTT	-904
ATGCAT	-905
CCACTT	-906
CCCCTG	-907
ACTGGGT	-908
ACAAAAT	-909
AAGAAAT	-910
CAGCCT	-911
AAAAGAG	-912
CCATTG	-913
TGGGTG	-914
ATTTCTG	-915
CAACTG	-916
ACTCCAT	-917
TGTCTG	-918
AATCTT	-919
ACTAAG	-920
AAAGTTT	-921
CTCCTGG	-922
CACCTT	-923
CACACC	-924
AACTTTT	-925
ATGCTT	-926
AGGCTG	-927
CCTGGGG	-928
AACTCT	-929
CTGTAT	-930
CAGTAG	-931
CCTCAT	-932
CGGAG	-933
CTCACC	-934
AATTGG	-935
CTACAC	-936
TGTTAG	-937
CCATGG	-938
AACTAA	-939
AAACAAAA	-940
AGTCAG	-941
AATTTTTT	-942
ATATATT	-943
AGTCTT	-944
ATTGTTT	-945
AAAAAAAAAAAA	-946
CTCTGTT	-947
AGTCAT	-948
CAAGTG	-949
AAGTTTT	-950
ATTCAA	-951
AATCAG	-952
AAGCAT	-953
ATTTTTG	-954
AAGCTG	-955
CCCCTT	-956
ACCAGT	-957
ACCCAT	-958
ACTGGGG	-959
CTTGAACC	-960
CGGGTT	-961
ATCATT	-962
AATATTT	-963
ACATAG	-964
ATGTAG	-965
AAAACAA	-966
CTTTTGT	-967
ATTATG	-968
CAGTTG	-969
AAAACAT	-970
AATAAAT	-971
AACAAAA	-972
TGGCTG	-973
AGTAAG	-974
AAACAC	-975
CCCCG	-976
CTAAATT	-977
AGTCTG	-978
TGGTTTT	-979
CGTGGTGG	-980
CTTGTTT	-981
CGGGT	-982
AAGGAAG	-983
CCTCTC	-984
ATGTTTG	-985
CAAATAT	-986
CCCAAG	-987
CATGGTGAAACC	-988
CTTTGTT	-989
AAAAACT	-990
TTTCACC	-991
CTGGGGG	-992
TGTCAT	-993
AGGATT	-994
ATTTCAT	-995
▁GT	-996
CCTAAT	-997
CGCGG	-998
CAACAC	-999
CCATGT	-1000
AGGATG	-1001
ACGGG	-1002
ACAGAT	-1003
AAACTTT	-1004
CTAACC	-1005
ATTTAAT	-1006
TGTGAT	-1007
ATATTTGG	-1008
ATATAG	-1009
ACCTCT	-1010
TGTATG	-1011
AAAGAAAA	-1012
CCCCAT	-1013
CGTTGGAAAC	-1014
ATTCAC	-1015
AACGT	-1016
CCAAGT	-1017
AACCAC	-1018
TGAGAT	-1019
ACCCTGT	-1020
CTTTTTGT	-1021
AATACT	-1022
TGAGTG	-1023
CCAATT	-1024
CCCATG	-1025
TGGCAG	-1026
CTTTCTG	-1027
CATTAT	-1028
CTACG	-1029
ATGGTTT	-1030
CAAAGAG	-1031
CTTGAT	-1032
CCGTT	-1033
ACCTAG	-1034
ACCCTT	-1035
AGTAGG	-1036
AAGGAT	-1037
AAGAAAG	-1038
AGGGTG	-1039
ATTTTGG	-1040
AGGTAG	-1041
CAATTG	-1042
CTAAATG	-1043
AAACATT	-1044
AAGCTT	-1045
ACTAGG	-1046
CTCACAG	-1047
CATTTTTT	-1048
CTCGGCTCACTG	-1049
AAGTAT	-1050
TGTAAT	-1051
TGTCAG	-1052
CTGAGAT	-1053
AGCCGGG	-1054
ACTTAG	-1055
CCACCACG	-1056
CTGCAA	-1057
CCCTGT	-1058
CAATAG	-1059
ATTTTAT	-1060
CTTATG	-1061
CGTTGGAAACGGG	-1062
CTCATTT	-1063
AGTCAC	-1064
AACTAC	-1065
TGGATT	-1066
CATTAG	-1067
CCACAT	-1068
CTCTAT	-1069
ACAGAAT	-1070
CTCTAG	-1071
CTAATTTTT	-1072
ATGGAT	-1073
CTTTATT	-1074
CCTCTCC	-1075
CGCAG	-1076
AATAGG	-1077
ACAAAAG	-1078
CTGCCTG	-1079
ACACCTGT	-1080
AATAGT	-1081
CCGAGAT	-1082
CAAAACC	-1083
CTAAAAG	-1084
CCTATG	-1085
TGGTAG	-1086
TGGGGGG	-1087
CTCACG	-1088
CAGTTTT	-1089
ACTCCAG	-1090
CTGGTTT	-1091
CTCACTT	-1092
TTTTTTTTTTTT	-1093
CCTAAG	-1094
CAAATGT	-1095
CATAGAG	-1096
ATGAAAA	-1097
CTCCTTT	-1098
CATTGG	-1099
AAAATAG	-1100
CTACTTT	-1101
TGGTTG	-1102
CTTCCTG	-1103
CTTAAG	-1104
AAAATTTT	-1105
TGGCTCACG	-1106
CCTTAG	-1107
AAGGAGG	-1108
CAGCAA	-1109
AAAGAAT	-1110
CGTGT	-1111
CCTGGGCAA	-1112
CCAGGT	-1113
CCTGTAAT	-1114
AAAAGGG	-1115
AAATTAG	-1116
ACAGTTT	-1117
CCCAGT	-1118
ACAAATG	-1119
ATTAAAA	-1120
CTACTCAGGAGG	-1121
CCCCAC	-1122
AAAATTG	-1123
CTTTGAGG	-1124
TGACAGAG	-1125
CCAGTTT	-1126
CTTAGG	-1127
CACTGGG	-1128
ATTTCAG	-1129
CTCTCTCT	-1130
AACGG	-1131
CACAGTG	-1132
AAATAAG	-1133
ATGAGT	-1134
ACCCAGG	-1135
CACCTGG	-1136
ACCCAA	-1137
AAATTTTT	-1138
CTTTTTG	-1139
CACACAG	-1140
AATGGGG	-1141
CATGTTT	-1142
CTGGGATT	-1143
ATAGTTT	-1144
ACTCAT	-1145
AATCAA	-1146
CCTCCCC	-1147
CCTCT	-1148
CACCAA	-1149
CTACTTGGGAGG	-1150
CCTCAGG	-1151
CTAGTTT	-1152
CTCTTTTT	-1153
CGCTG	-1154
ACTGTTT	-1155
CAAGAT	-1156
CAAGACCAG	-1157
AATTTTG	-1158
CAGAAGG	-1159
CCTGTAGTCCCAG	-1160
CTCAGGTGAT	-1161
CACATGT	-1162
ATGCAA	-1163
TGTGTTT	-1164
AAAACTT	-1165
AAACAAT	-1166
ATTGAT	-1167
AATTCTT	-1168
ACAACC	-1169
AATGAAT	-1170
AAATGGG	-1171
AAACTGG	-1172
ACAAATT	-1173
CACATGG	-1174
CCATTTT	-1175
CATAAG	-1176
AACAAAG	-1177
AATTTGT	-1178
CTCAGGG	-1179
CTTGGGG	-1180
TTTTTG	-1181
TGTGGTGG	-1182
CCACAC	-1183
AACCTC	-1184
▁AG	-1185
CCACCTG	-1186
ACCTCTT	-1187
CGGTT	-1188
CCTCCCAAGTAG	-1189
CTGGAT	-1190
AGAGAGAG	-1191
AAAAATAT	-1192
TGAGACCAG	-1193
AAAATAAT	-1194
AAATATG	-1195
CATCAA	-1196
ACGTG	-1197
ACCCG	-1198
ACCACT	-1199
CATAGG	-1200
AACCTTT	-1201
ATTAGT	-1202
AAGGCAG	-1203
▁TG	-1204
AAAGAGG	-1205
TGTTAT	-1206
CCATAT	-1207
CACCCAG	-1208
ACCTAT	-1209
CTATTTTT	-1210
CCCTTG	-1211
CTCTGTG	-1212
TTTCAC	-1213
CTCAAACTC	-1214
ACCCAGT	-1215
CTCAGTT	-1216
CTACTCGGGAGG	-1217
CACACT	-1218
CCGTG	-1219
TGTAGAG	-1220
CTGGAAG	-1221
AAAAAATT	-1222
AAAGCAG	-1223
ATCATG	-1224
TGTCTTT	-1225
CTTATTT	-1226
ACAGAGG	-1227
CCTCTTT	-1228
CAGGAAG	-1229
CTCTCTG	-1230
ACCACTG	-1231
CACCTCAG	-1232
AGTATG	-1233
CACCACTG	-1234
AGAAAGG	-1235
CTTCTC	-1236
CAACCTCTG	-1237
ATTTTATT	-1238
CCAGGGG	-1239
CCAAAC	-1240
CGGGAGG	-1241
AAATAAAA	-1242
AAATATTT	-1243
CTCAAGTGAT	-1244
AGTAGT	-1245
CACATTT	-1246
CACAAAG	-1247
ACAGGGT	-1248
CTCACTCTGT	-1249
CTCCCAG	-1250
CCAATG	-1251
AGGGAT	-1252
AATTTAT	-1253
CAAATTT	-1254
CTCCTGT	-1255
CCTGGGT	-1256
TGAGTTT	-1257
TGGTGT	-1258
CTTCCAG	-1259
ACACTC	-1260
CAGGAT	-1261
ACAGCAG	-1262
CCTGTTT	-1263
CAAAAAC	-1264
AAGGAAGG	-1265
ACTTAT	-1266
TGGATG	-1267
CATTATT	-1268
AATATAT	-1269
CCTAGT	-1270
CTCAAAG	-1271
AAAAAAAG	-1272
CCTTCTG	-1273
ATAGAT	-1274
CTCATTG	-1275
CTCCAGG	-1276
AAAACTG	-1277
CCATAG	-1278
TTTTAT	-1279
CTTGCTCTGT	-1280
ACTGAGG	-1281
TGTGTGT	-1282
ATTAGG	-1283
CACACAT	-1284
ATGGGGT	-1285
ATACAAAAATTAG	-1286
CATAGT	-1287
AACAATT	-1288
AATGATG	-1289
CTTGGTT	-1290
AATTAAT	-1291
AAAGGGG	-1292
ACAATTT	-1293
CAGTAT	-1294
ATTTGTT	-1295
CATGGTG	-1296
TGTAAG	-1297
ATTCCT	-1298
TGCCACTG	-1299
AAATCAT	-1300
TGGTAT	-1301
ACAGATG	-1302
CTGGAGT	-1303
CGAGACCAG	-1304
AATGGGT	-1305
AATGAAG	-1306
CATTCTT	-1307
TGGGAAG	-1308
AATTCAT	-1309
CTAATAT	-1310
AACAATG	-1311
CTGCAGG	-1312
TGTTTGTT	-1313
CTCTACT	-1314
TGGAGT	-1315
CCTTAT	-1316
ATAGTG	-1317
CGATG	-1318
CTCTCAG	-1319
CATAAAA	-1320
ACACATG	-1321
CTGGGAG	-1322
CTCAGAG	-1323
CTCTCTT	-1324
ATTCTTT	-1325
▁TTT	-1326
CACATAT	-1327
CTCCTTG	-1328
CAAGCGATT	-1329
CACCTCC	-1330
AAATTTG	-1331
CACCCAGG	-1332
ATTCATT	-1333
CAAGCAATT	-1334
CATGGGG	-1335
CCCCAGG	-1336
ATTTCTTT	-1337
CAAAAGT	-1338
ATGAAAT	-1339
CTTAGT	-1340
CCACCTCC	-1341
AGGGAAG	-1342
CAAGTGATT	-1343
CCTTCCTT	-1344
CTGAGAG	-1345
CTCTTGT	-1346
CCAGAT	-1347
AGGAGT	-1348
ATGGGGG	-1349
ATTAAAT	-1350
ATTTGTTT	-1351
AAGGTTT	-1352
CCTCTGG	-1353
CATTTGT	-1354
CCACCAC	-1355
TGGCAT	-1356
AAAAGGT	-1357
CCAGGATGGT	-1358
AAACATG	-1359
TTTTTTTTTTTTTTTT	-1360
AATAATT	-1361
AAATTAT	-1362
CCTGAGG	-1363
TGGGAT	-1364
CAGAAAT	-1365
ACCTAC	-1366
CTAGTG	-1367
AAACAGG	-1368
CTTGGCTCACTG	-1369
CTCAGCTCACTG	-1370
CCCACT	-1371
CACTGTT	-1372
CAGCAC	-1373
CAGCG	-1374
AGCAA	-1375
ATGTATT	-1376
ATGTTTTT	-1377
CGGGGG	-1378
CTTCTCC	-1379
AAAGATG	-1380
CTCAAAT	-1381
CTGTTTTT	-1382
ACTGAT	-1383
CAAGTTT	-1384
CAAGGGG	-1385
CTGTGTG	-1386
AGGTAT	-1387
CTGCAC	-1388
CTCACTC	-1389
ACACAGG	-1390
CAAAGTT	-1391
CTGGGTG	-1392
AGAATT	-1393
CAGAAAA	-1394
ACAGTGG	-1395
CTGCG	-1396
CATTCC	-1397
CCTCAAG	-1398
CTGCAAG	-1399
CTTTTGG	-1400
CATGAGCC	-1401
ACGGT	-1402
CATTTTG	-1403
CTAGAT	-1404
CAAAAGG	-1405
ACTACT	-1406
AAACAAG	-1407
AAAATATT	-1408
TGTATTT	-1409
ACTCCGT	-1410
AGTTGAA	-1411
CCACGG	-1412
ATGGAAT	-1413
CTATTTG	-1414
AAAGAAAT	-1415
CAGTGGCG	-1416
AAACTGT	-1417
CATATTT	-1418
TTTCACCATGTTGG	-1419
AGAAGG	-1420
CGGAT	-1421
ACATGTG	-1422
CAGGAGTT	-1423
CTGGGGT	-1424
AACATGG	-1425
AGTGAG	-1426
ATGGAGG	-1427
CCTGGCTAA	-1428
CTGAAAT	-1429
AAAAGTG	-1430
CCTTTGT	-1431
CTTCATT	-1432
AAATGTG	-1433
CATCTC	-1434
ACCCCAG	-1435
CTTTAAT	-1436
AAATATCTT	-1437
ACAGAAGCATTCTCAG	-1438
CCTCAGT	-1439
CAAAGGG	-1440
CCTGCC	-1441
AAATGTTT	-1442
ATTTTAG	-1443
CACCCAGGCTGGAGTG	-1444
CTTAAAA	-1445
ACATATT	-1446
AACACTT	-1447
CCTCTGT	-1448
AATTTGG	-1449
AATGGTT	-1450
CCTATTT	-1451
AACAGAG	-1452
CAGAAAG	-1453
CAATGTT	-1454
CTCGTGAT	-1455
ATGGTGG	-1456
ACATTTG	-1457
AACACTG	-1458
ACCTTTT	-1459
AATGTTTT	-1460
CACACTG	-1461
AGAGAT	-1462
CAAAGAT	-1463
CTGCTTT	-1464
CGCTT	-1465
AAATGGT	-1466
TGTATAT	-1467
CCGTCTCTACTAAAA	-1468
CGGTG	-1469
ACTAGT	-1470
AACAAAT	-1471
AAATAGG	-1472
TGCCCAGGCTGGAGTG	-1473
AATGATT	-1474
CCCTCT	-1475
AAACCAT	-1476
CCCCGG	-1477
CAAACTG	-1478
CTTCTGT	-1479
AATCAC	-1480
TGTAGG	-1481
ACCATTT	-1482
AAGAATT	-1483
AGTTAG	-1484
AAAAAAAAAAAAAAAA	-1485
AGGGTTT	-1486
CCAGAGG	-1487
CTCTTTG	-1488
ATTGTGG	-1489
TGAGACGG	-1490
TGAGAGG	-1491
ACTTTTTT	-1492
ACACTGT	-1493
CAAATGG	-1494
CCTGAT	-1495
CTTACT	-1496
AAGAATG	-1497
TGGGTTT	-1498
CTGACT	-1499
AATCG	-1500
AACCG	-1501
CAAACAG	-1502
CCTCTTG	-1503
NNNNNN	-1504
TGTGTGTGTGTGTGTG	-1505
CCTACT	-1506
ACTTTGT	-1507
AAATGAG	-1508
CACAGGG	-1509
CTTTCAT	-1510
CTGAGGCAGGAG	-1511
▁AT	-1512
CACCATG	-1513
CAACG	-1514
ACAAAGG	-1515
ACCGT	-1516
CTCAAGG	-1517
AAAAAATG	-1518
CGACAGAG	-1519
CAGGCAG	-1520
ATATATG	-1521
ACAATGG	-1522
CTGAGGT	-1523
CTCTGAG	-1524
ACCCCAT	-1525
CTCACAC	-1526
CTCGCTCTGT	-1527
CCACTC	-1528
CTCGAA	-1529
AAAAGAT	-1530
CTATGTT	-1531
CTTGAGG	-1532
AATTCAG	-1533
ATTTATG	-1534
AATAAAG	-1535
CAACAGAG	-1536
AATGAGG	-1537
CAGGGGG	-1538
TGGAAGG	-1539
AATGTGT	-1540
ATATAAT	-1541
CTGGATT	-1542
CACTAT	-1543
AAACAAAC	-1544
CTTTGGG	-1545
AAATTGT	-1546
CATCTTT	-1547
ATGGATT	-1548
CTAATGT	-1549
CTCGAT	-1550
AAA	-1551
ATGGAAG	-1552
CTGAAAA	-1553
ACACACACACACACAC	-1554
CTGTGTT	-1555
AAAAGAAG	-1556
CACAAAA	-1557
TGAGATG	-1558
TGGCTCATG	-1559
CAAAGAA	-1560
CCTGGTT	-1561
AAGGGGG	-1562
CAACCTCCG	-1563
CACTTGAG	-1564
ACTCTTT	-1565
AGAGTG	-1566
CTCTGGT	-1567
TGTATTTT	-1568
CCCAAT	-1569
CGCCACTG	-1570
AAGAGAG	-1571
CTCATGT	-1572
AGTATTT	-1573
ACACTTT	-1574
ACCAAAA	-1575
CGAAG	-1576
ACCACTT	-1577
ACATTTTT	-1578
ATGTGTGT	-1579
CATCCT	-1580
AACTCAG	-1581
AGTTAT	-1582
AACTCTT	-1583
CAGGTTT	-1584
CTCCCC	-1585
ATTACT	-1586
AAGGAAT	-1587
AACTCTG	-1588
ACCTAA	-1589
CTGCCTT	-1590
CTCATGG	-1591
CAGAGAG	-1592
AACAAGG	-1593
AAACAGT	-1594
CAAATAG	-1595
CCCAGTT	-1596
ATTATAT	-1597
CTGTCTT	-1598
CATTCAT	-1599
CAACAAG	-1600
CATTCTG	-1601
AAGTCAG	-1602
ATTTTCTT	-1603
TGAGACAGAGT	-1604
AATTTTTTT	-1605
TGTTTTG	-1606
CACTAG	-1607
CAATAAT	-1608
AGGCAT	-1609
CCTGCAG	-1610
AGGAAAA	-1611
AACATTTT	-1612
CTTTTAT	-1613
AAACGT	-1614
AAGTAAT	-1615
ATTTGTG	-1616
TTTTCTT	-1617
ACCGG	-1618
CTTTCAG	-1619
CCAGCAG	-1620
CTCAGGT	-1621
ACTGCAG	-1622
CCCCTC	-1623
AGAATTG	-1624
ATTTAAAA	-1625
AACTGGG	-1626
CCAACC	-1627
CTTTGTTT	-1628
CCTGTGT	-1629
CAAACAT	-1630
ATTTTTGT	-1631
ATGACT	-1632
AACACAG	-1633
AATTCTG	-1634
CCAGAAT	-1635
ACCTGGG	-1636
CTGTAAT	-1637
AATGTGG	-1638
CAATGGG	-1639
CGCTTT	-1640
ACCTCAG	-1641
TGTTTGT	-1642
AAGACT	-1643
CCTTGGG	-1644
CCTTTTTT	-1645
CCACAGG	-1646
CTCCCTG	-1647
ATACATG	-1648
AAAATGTT	-1649
CATTTGG	-1650
CCCTAG	-1651
ACACATT	-1652
CACCAGG	-1653
ACATATGT	-1654
CTTTGAG	-1655
AAAGTGG	-1656
AAACCAG	-1657
ACATGTT	-1658
CCTTTGG	-1659
AATAAAAT	-1660
CTGCAGTGAG	-1661
AAGTATT	-1662
AATGCAG	-1663
CAAATTG	-1664
ACGTTT	-1665
ACTTTGG	-1666
CTTCG	-1667
ACAAAGT	-1668
AATTATG	-1669
CCTCCTGGGTT	-1670
AGAGTTT	-1671
CCAAAAT	-1672
CCTCCG	-1673
CCCGT	-1674
CAGGGTT	-1675
CAGGCTGGT	-1676
CGCCTG	-1677
CATTTAT	-1678
AAATCAG	-1679
AGAAAAGG	-1680
CCTCCCGGGTT	-1681
CCTTTTG	-1682
TTTTTTTTTTT	-1683
CTGTATT	-1684
ACAGATT	-1685
CCAGGTT	-1686
ACAGAGTTT	-1687
CTGAAAG	-1688
ACTATTT	-1689
CATCG	-1690
CCCAGAG	-1691
CTCACAT	-1692
AGTCAA	-1693
AAATGAT	-1694
ACTTTTG	-1695
ACAATGT	-1696
AGAGAAG	-1697
AAAGGTT	-1698
AGTGTTT	-1699
AAGGATG	-1700
CTGGCTT	-1701
ACAGAGTTGAA	-1702
AGGAAAG	-1703
CATGTGT	-1704
CACAAAT	-1705
CATGATG	-1706
CACATTG	-1707
ACACGG	-1708
CCAGGAG	-1709
CCAGAAG	-1710
ACCATGT	-1711
CCTTGTT	-1712
AACATGT	-1713
CCAGGTG	-1714
CAGGGAG	-1715
CTGACTT	-1716
AGGCTT	-1717
ATGGGTT	-1718
CTGTGAG	-1719
CTCATTTT	-1720
CGTTG	-1721
AGGGCAG	-1722
CTTTTCTT	-1723
AGAACAG	-1724
CACACG	-1725
AATTGAA	-1726
ATGGCAG	-1727
CACGTT	-1728
AAGATTT	-1729
CTGAATT	-1730
AAAAGAAAA	-1731
CTTGCAGTGAG	-1732
ATGGGGTTT	-1733
CTGTTTG	-1734
AGGGAAT	-1735
CGTGTG	-1736
ACTCT	-1737
ACCCTTT	-1738
CTTGTTTT	-1739
CATCTGT	-1740
CCTTCTT	-1741
CCTTGAG	-1742
CTGTGGG	-1743
CACGTG	-1744
ATGTATAT	-1745
TGTAGT	-1746
CACAATT	-1747
AACTATT	-1748
AAAGATT	-1749
CAACATT	-1750
CTGGGACTACAGG	-1751
CGAAT	-1752
ACCTCTG	-1753
AAATCTT	-1754
AGTGAT	-1755
ACAGGGG	-1756
ACGGGGTTT	-1757
CAAGAAG	-1758
CAGGGGT	-1759
CACCTC	-1760
CAATATT	-1761
TGTTGGG	-1762
CTCTTGG	-1763
CGTTTT	-1764
CTTGGGT	-1765
CTAAGTT	-1766
ACCCCT	-1767
ATGTAAT	-1768
AACAGTT	-1769
ACTTCTT	-1770
CTGCTGG	-1771
TGAGATGGAGT	-1772
AATTATTT	-1773
AAAAATAA	-1774
CAGTGGTG	-1775
AATTCC	-1776
ACTGGTT	-1777
AAAGAGT	-1778
CCACCATG	-1779
AAGGGTT	-1780
CTTGAAT	-1781
CTGGAAT	-1782
TGACAG	-1783
AGGTGT	-1784
CCTCCCAGGTT	-1785
CTACTGT	-1786
CAGGTTTG	-1787
ACATATG	-1788
CTAATGG	-1789
CAGGTGG	-1790
ATTTCAA	-1791
AATGAAAT	-1792
CTCCATG	-1793
CCTTCAG	-1794
ACTTCAT	-1795
ATTGTTTT	-1796
AAAAATGT	-1797
CAAGAGG	-1798
ACTTATT	-1799
AGAAAGT	-1800
CATTCAG	-1801
ACCAAGG	-1802
AGAGCAG	-1803
CCACGT	-1804
CTCAATT	-1805
ACTGTGG	-1806
CGCCG	-1807
CCTCCAT	-1808
AGGTTTT	-1809
CAAATAA	-1810
AAACGG	-1811
CCTGTGG	-1812
CACAGTT	-1813
CCCACC	-1814
ATGGTTTT	-1815
ACCCTGG	-1816
ACATAAT	-1817
AGGTCAGGAGAT	-1818
TTTAG	-1819
AAAAATAG	-1820
AGACGG	-1821
TGGGTGG	-1822
CTGAAGG	-1823
AAATTGG	-1824
CTGCAAGTGG	-1825
ATGTTGT	-1826
AAGACAG	-1827
CTTCCCC	-1828
CGAGT	-1829
CCTGGAG	-1830
ATTATAGG	-1831
ACTTCAG	-1832
AGGGGGG	-1833
CTGCATT	-1834
ACCCAAG	-1835
CTGTTGG	-1836
CATGTGG	-1837
AGGTCAG	-1838
ACACCTGTAATCCCAG	-1839
CCCAGGG	-1840
AATGAATG	-1841
ACTATAT	-1842
ATTTTGTT	-1843
CCAGTTTT	-1844
CTATGTG	-1845
CCCTAC	-1846
CTTCTGG	-1847
AGGGTGG	-1848
AACTTGG	-1849
AAATAGT	-1850
AACTGTG	-1851
ACAGTGT	-1852
CTGAGTT	-1853
ACCCCTG	-1854
CTAAGAG	-1855
ATGTTGGT	-1856
ACTCAGT	-1857
CACCCT	-1858
AGGAAGG	-1859
CACCAAG	-1860
ATGATTT	-1861
CCATCTCTACTAAAA	-1862
CAAGGTT	-1863
CACTGTG	-1864
CTCTATT	-1865
CTCTCAT	-1866
ATAAAGT	-1867
AGGCGG	-1868
CACGAT	-1869
ATACATT	-1870
CACAGAA	-1871
CTCAGTG	-1872
CATGGTT	-1873
CAATGGT	-1874
CTATAAT	-1875
ATATGT	-1876
CTATATT	-1877
AAGAAGG	-1878
ACTTGTT	-1879
ACTGTTTT	-1880
AATTTAG	-1881
ACCATGG	-1882
CTTCTTG	-1883
CAACTCC	-1884
AAAAGTTT	-1885
ATGATTG	-1886
CTTCAGG	-1887
CCACCAT	-1888
TGAGAAG	-1889
ACAAGAG	-1890
CTTTATG	-1891
CTCAAGT	-1892
AAACATTT	-1893
AATGCTG	-1894
AAAGGGT	-1895
CCAGCC	-1896
CCTCCTGAGTAG	-1897
AAATAATT	-1898
ACTTCC	-1899
ATATTTT	-1900
CTCGGG	-1901
ACTGTGT	-1902
CTGGTGG	-1903
CCGGGG	-1904
CCTTGCC	-1905
CCTATAAT	-1906
ACCTTGG	-1907
AAATAAAG	-1908
CAAAGAC	-1909
ACTGAAT	-1910
ATTGAAT	-1911
CAGCTTT	-1912
CCATTGT	-1913
CACTGGT	-1914
CACAAGG	-1915
ACAAGGG	-1916
ATTTAAG	-1917
AACTAAT	-1918
TGGTTTTT	-1919
AGTTTGG	-1920
CTAGGTT	-1921
ACATTGT	-1922
CAACATG	-1923
ATTTGGG	-1924
CCTTGTG	-1925
CAAACTT	-1926
ACATAGG	-1927
CCTGCTG	-1928
ATGTATG	-1929
AGACAG	-1930
CTCATAT	-1931
CCCCACC	-1932
CCTGAAG	-1933
CCACATG	-1934
ACACTGG	-1935
CATTCAACTC	-1936
AAAAAGAG	-1937
CACATAG	-1938
ATTAATT	-1939
CTACTGG	-1940
CTCCTCT	-1941
CCCTTTT	-1942
AGAATG	-1943
AAGTTTTT	-1944
CTCCTGGG	-1945
AGGATTT	-1946
CTGGCAG	-1947
CTCTGTTT	-1948
CGTGGG	-1949
AACTCAT	-1950
CTGGATG	-1951
AACTGTT	-1952
CCTCCTT	-1953
ATTTTATTT	-1954
CGCCCAGGCTGGAGTG	-1955
CTCCCTCC	-1956
ATGTCTT	-1957
CACAGAT	-1958
ATGGATG	-1959
ACAATAT	-1960
CTCGTT	-1961
AATGTTG	-1962
CTGGCC	-1963
AAGTCTT	-1964
CACAATG	-1965
CAAACC	-1966
TGGGGGT	-1967
AGACT	-1968
CCATATG	-1969
AGAGAGG	-1970
TGGTGGG	-1971
ATTCTGT	-1972
CAACTTT	-1973
CTGGCTG	-1974
AGTTTTG	-1975
ACTTTGTG	-1976
AACCAGG	-1977
CTTGAAG	-1978
ATTTGAG	-1979
ACTCAGG	-1980
CTCCCG	-1981
ATATATTT	-1982
TGGCG	-1983
AGGGAGGG	-1984
TGAAAGG	-1985
AACAGGG	-1986
ACTTGAG	-1987
AGTCATT	-1988
CTCAAAAT	-1989
CTATTGT	-1990
AAAAATTT	-1991
CAGTTTGG	-1992
AATTAAG	-1993
CTGATTT	-1994
CAGTTTTT	-1995
CAATTTTT	-1996
ATAAAGG	-1997
CTTCATG	-1998
CCTCTTTT	-1999
CTTCTCT	-2000
ACTGAAG	-2001
CATTGTT	-2002
ACTGAGT	-2003
AATAGAG	-2004
AACTTTG	-2005
ACACAGT	-2006
CCCTGGG	-2007
CACTTGG	-2008
CAAAGGT	-2009
AATATTTT	-2010
CTTTATTT	-2011
AACCCAG	-2012
AAATAAAAT	-2013
AATTAAAA	-2014
CTGTGAT	-2015
CTTTAAG	-2016
ACTCAAG	-2017
CTGCTGT	-2018
ATTCTGG	-2019
AATGAGT	-2020
ATTATTTT	-2021
CTGAGGG	-2022
AAAATTAG	-2023
AAGTTGG	-2024
ACAAAAAT	-2025
CTCCGG	-2026
CGAGACCAT	-2027
CCAAAGG	-2028
CCAGGAGTT	-2029
AACCTGG	-2030
CACAGCC	-2031
CTGTGGT	-2032
AATTCCAG	-2033
AAGTCAT	-2034
CTAAGGG	-2035
AAAAATAC	-2036
CTAGAAT	-2037
TGAGACGGAGT	-2038
CAGTCAG	-2039
AATGCTT	-2040
AAAGTTTT	-2041
CGCAT	-2042
CAGTTTG	-2043
ACCTAGG	-2044
CTCCTGACCTCGTGAT	-2045
AACTTGT	-2046
ACTTAAT	-2047
AAAAAAAAT	-2048
CAGTAAG	-2049
AAAGCAT	-2050
AGATTT	-2051
AAAGTGT	-2052
CGCCCGG	-2053
CTGGAATT	-2054
ATGTGTT	-2055
CTTGAACCTGGG	-2056
CACACCTGG	-2057
CCATAAAA	-2058
CCACCAG	-2059
CTCCATT	-2060
CCTCCCAG	-2061
CTCTACAAAA	-2062
ACAAGTT	-2063
CTGCAAT	-2064
CACCATT	-2065
CTCAATG	-2066
ATGAATT	-2067
ACCACAG	-2068
CCCCCAG	-2069
CTGTAATCCCAG	-2070
AAGGAAAA	-2071
CCAGTGG	-2072
CTATCAT	-2073
AAGGTGG	-2074
AGCCAAG	-2075
CACTTTG	-2076
ATTGTGT	-2077
CAAGCG	-2078
ATGGGAG	-2079
CTCCGT	-2080
ACAAGGT	-2081
CACTCTG	-2082
AAATACT	-2083
CCAGATG	-2084
AAACTTTT	-2085
ACTCATT	-2086
CTTGCAG	-2087
AATGCAT	-2088
CTTTCCT	-2089
ATATCTT	-2090
ACCCATT	-2091
CTCCCAT	-2092
CCTCATG	-2093
CACTTGAACC	-2094
CAAGAAT	-2095
ATAGAG	-2096
CTGTCC	-2097
TGGAGGG	-2098
AAAAGAGG	-2099
CTGTTGT	-2100
CCTAGAG	-2101
CATGAAG	-2102
CCAAAGT	-2103
ATAGAAG	-2104
CTGAGTG	-2105
ACGAG	-2106
ATTGCAG	-2107
TGGGGTT	-2108
CCTTTAG	-2109
CAAACAC	-2110
CTAGAAG	-2111
ATGATAT	-2112
CCGTTT	-2113
AAACAAAT	-2114
TGAGCAG	-2115
CTGTCAG	-2116
CTGTCAT	-2117
AAACACTCTTTTTGT	-2118
CCAGCAT	-2119
CTTGAGT	-2120
ACTACAG	-2121
ATTGATT	-2122
CACCCC	-2123
TGGATCACCTG	-2124
AACAAGT	-2125
CCTCATT	-2126
ACCTTGT	-2127
ATAGCAG	-2128
CATTTAG	-2129
CAAAGCC	-2130
CACATTTT	-2131
ACTGTAG	-2132
TGAAAGT	-2133
AAATTATT	-2134
AAGTTTG	-2135
CCTGACCAA	-2136
ATTTCCT	-2137
CTACAGT	-2138
ATTGAGG	-2139
CATGCTG	-2140
CTAAAGT	-2141
AACTTTTT	-2142
ATAAAATG	-2143
ATAGATT	-2144
TGCCCAGGCTGGT	-2145
CATATGG	-2146
ATGAAAG	-2147
CTCTCG	-2148
CACTCAG	-2149
ACCAGGG	-2150
CTCCCTT	-2151
CCACATT	-2152
CTTGCTT	-2153
CTAGGGG	-2154
CACCCTG	-2155
TGGGGAG	-2156
AAGCATT	-2157
CCGAGGCGGG	-2158
CTTGCC	-2159
CATATAT	-2160
ACTTGGG	-2161
ATAGAAT	-2162
TTTTAG	-2163
CTAAAGG	-2164
CTAAGTG	-2165
CGCTTGAACC	-2166
CCTATGT	-2167
CATGAGG	-2168
AATGAGAT	-2169
ATTTTAAT	-2170
CACACTT	-2171
CATCATT	-2172
AAAGCC	-2173
ACAGGTT	-2174
CTTTCTGT	-2175
AAGGGAG	-2176
ACTAAAT	-2177
ACTGCC	-2178
ATTTCCTT	-2179
CTCCAAG	-2180
ATGCTGG	-2181
AACTGAG	-2182
ATAAAATT	-2183
AAGGAAAT	-2184
AAAATAAAA	-2185
CTACTTTT	-2186
CAACAAT	-2187
CTGAAGT	-2188
ACAAAATT	-2189
TGTTTGG	-2190
CCACAGT	-2191
CTAAAATT	-2192
CAGAGTG	-2193
CTTTTAG	-2194
CAGCAGG	-2195
CGTAG	-2196
ATGTAAG	-2197
CGGAGG	-2198
AACACAC	-2199
CTGCCAG	-2200
CTCAAAC	-2201
CCTAAAA	-2202
CAAATAC	-2203
CTGGGAGG	-2204
ACACGT	-2205
ATTTATAT	-2206
CAGGCCT	-2207
CTAAGGT	-2208
ACATCTT	-2209
ATGTCAT	-2210
TGTTATT	-2211
TGTTGTG	-2212
TGAGAAT	-2213
CCCTAT	-2214
CACCTTT	-2215
CTACATT	-2216
ACTCTGG	-2217
ATGAAGT	-2218
ATTTTATTTT	-2219
CTATGGG	-2220
ATGTCAG	-2221
TGGGCAG	-2222
CTTGAACTC	-2223
CAGTATT	-2224
AACTATG	-2225
CAAGGGT	-2226
TGCCTG	-2227
AAAGTAG	-2228
ATACAG	-2229
CATTCATT	-2230
CATGTTTT	-2231
TGAAACT	-2232
AAAGGAG	-2233
CTCCAGT	-2234
CTTTCCTT	-2235
CTTACTG	-2236
ACATGGG	-2237
AAAAACAG	-2238
AACTAAG	-2239
AAATCC	-2240
AAATCTG	-2241
AATTTTGT	-2242
CACTTTTT	-2243
ACTTCTG	-2244
AAATATCTTCC	-2245
ATGAATG	-2246
CAATGTG	-2247
AATAATG	-2248
CAAGCAG	-2249
AAAATGGG	-2250
CTTGTGG	-2251
AAAAAAATT	-2252
ACCTGAG	-2253
AATCCT	-2254
ATTGAG	-2255
CCATCC	-2256
AATACAG	-2257
ATGGTGT	-2258
ATAATG	-2259
CATAATT	-2260
CTCATAG	-2261
ATACAAAAATT	-2262
CACCCG	-2263
TGGTTTG	-2264
CGGGCG	-2265
CTGCAGT	-2266
ATTGCTT	-2267
AACACAT	-2268
ACATGGT	-2269
CTGTCTCTACTAAAA	-2270
ACTCGG	-2271
CACTGAG	-2272
CTTGGTG	-2273
ATTTAGT	-2274
ACAGGGTTT	-2275
ATGCCT	-2276
AAGAAAAT	-2277
CAGGCG	-2278
CCAACAG	-2279
ATAAAC	-2280
ACCTAAT	-2281
CTGTTTGT	-2282
CTCATCC	-2283
TGTTCTT	-2284
CATGGGT	-2285
ACAACAG	-2286
CCCAGCTAATTTT	-2287
ACTATGT	-2288
CAACAGG	-2289
TGTGTGG	-2290
AAGTTGT	-2291
CATGATT	-2292
AAAACTGG	-2293
CACAGGT	-2294
CTAGAGG	-2295
CCATCAT	-2296
CTGAATG	-2297
▁GGG	-2298
CCAGCTT	-2299
AAGGAAAG	-2300
AGTCCT	-2301
CAGGTAG	-2302
ATTTCATT	-2303
AAACACTCTTTT	-2304
AGGGATG	-2305
AATTTATT	-2306
TGCTGG	-2307
AGTTTGT	-2308
CACTTGAA	-2309
ATAGATG	-2310
CACCTTGG	-2311
CTATGGT	-2312
AAGCCT	-2313
CACTTTGGG	-2314
CAAGATG	-2315
CACAGAC	-2316
CTGCTCC	-2317
CCATCAG	-2318
CATAAAT	-2319
AGGAGAG	-2320
CTTGATT	-2321
CTAATTTTTT	-2322
CAGGCC	-2323
AATTTTTG	-2324
AGTAAAT	-2325
CATAAAG	-2326
ATTTTCTTT	-2327
AAACAAAG	-2328
AGTAAAA	-2329
CTGCCCG	-2330
CTTGTGT	-2331
ACTAATT	-2332
ACCAATT	-2333
CACTCC	-2334
CTGAGGTGGG	-2335
CCCCCG	-2336
CCATCTT	-2337
CCGAGATCG	-2338
CATGAAT	-2339
AGATATT	-2340
ATATTGT	-2341
AGGGGAG	-2342
CCATCTG	-2343
CAGGAGAAT	-2344
CTCCTAG	-2345
AGTAAAG	-2346
ATACAT	-2347
CTAACAG	-2348
ATATTGG	-2349
CTACAGG	-2350
AATGGAG	-2351
CTCTAGG	-2352
CTGTCTG	-2353
CCACCCG	-2354
AGCCGG	-2355
CACGGG	-2356
AGGGAGAG	-2357
ACGTGG	-2358
TGCAGTGG	-2359
AGGTAGG	-2360
CATATGT	-2361
CACTCG	-2362
CAGGAAT	-2363
AACCAAG	-2364
CAAAAAAT	-2365
AAGTAGG	-2366
AGAAAATG	-2367
CCTTGGT	-2368
CCTCCCGAGTAG	-2369
CACGCCATT	-2370
CAATTTG	-2371
AGACCAG	-2372
CAGGATG	-2373
CATACT	-2374
AAGGGGT	-2375
AAGGATT	-2376
TGCCATTG	-2377
CATTATG	-2378
CATCTCC	-2379
ACCAAAT	-2380
ACACAAT	-2381
CTTCCTC	-2382
AAAGAAAAG	-2383
TGTGAGG	-2384
AACTTCC	-2385
CACTATT	-2386
CGCATG	-2387
CCAAGAT	-2388
CATTAAT	-2389
CTGGTGT	-2390
CAGCCTC	-2391
TGTGTTTT	-2392
ACCAAGT	-2393
CAAATATT	-2394
ACCCGG	-2395
ATGGCTT	-2396
ACTCTC	-2397
CACCTTG	-2398
AGTTGAG	-2399
TGAGGTT	-2400
ATTTATTTT	-2401
CAGGCTG	-2402
ACAGGAG	-2403
ATCTGT	-2404
AAAATATG	-2405
AAAACAAT	-2406
ATTCCTT	-2407
AGGGGTT	-2408
CAACATGG	-2409
CAGTTGT	-2410
ACCCTC	-2411
ATAACAT	-2412
AAAATAAG	-2413
AAGGGAT	-2414
ATAAACT	-2415
AAATATTTT	-2416
ACAATAG	-2417
AATCTGCAAGTGG	-2418
AAGGTGT	-2419
AGTCTTT	-2420
CCATTTG	-2421
AAAATCTAG	-2422
AAAAACTAG	-2423
ATATATATATATATAT	-2424
CACTTGT	-2425
AAAGCTG	-2426
ACATCAG	-2427
ACTGTTG	-2428
CCCGGG	-2429
CTTAATT	-2430
CCGTGG	-2431
AAGAAAC	-2432
ACTCATG	-2433
AATGGTG	-2434
AGGTTGG	-2435
ATACTT	-2436
ACCAATG	-2437
ACCCAAT	-2438
CTTGAGCCCAGG	-2439
AGTAATT	-2440
CCTAAAT	-2441
CCGCCCG	-2442
CAGTGTT	-2443
AGTATAT	-2444
CTCTCTTT	-2445
ATACAAT	-2446
AATATATT	-2447
CTTGCTG	-2448
ACTCTCC	-2449
CCTAATT	-2450
CCTGGCTAATTTT	-2451
ATAGTTTT	-2452
AGGGTGT	-2453
ATTTTTTTTT	-2454
CAGTAAT	-2455
AAAACG	-2456
ACCCCTT	-2457
ACATATTT	-2458
CGGTGG	-2459
CTATATG	-2460
AAGTAAG	-2461
ACCTGTT	-2462
CCCCTCC	-2463
CTCTGGGG	-2464
CAAAAATT	-2465
CACATCC	-2466
TGTTGTT	-2467
TTTTTTTTTTTTTT	-2468
CAGTTGG	-2469
CTGAGAA	-2470
CATTGTG	-2471
CAATGAG	-2472
CTAAAAAT	-2473
ATTTAGG	-2474
CCCCAAG	-2475
CCAGTGT	-2476
CTCCTTTT	-2477
CCTCAGCCTCC	-2478
ATTACAG	-2479
ACCAGAG	-2480
CCTTCAT	-2481
ATGATGG	-2482
ATCTCC	-2483
CTGAGAC	-2484
CATGGAG	-2485
CCCACTG	-2486
CTTTTGAT	-2487
ACATTTGGAG	-2488
CTGACAG	-2489
ACCACC	-2490
AAAACAC	-2491
ATGAGTT	-2492
CTTCAAG	-2493
AGATAAT	-2494
ATAATAAT	-2495
CCTAGGT	-2496
CCAAATT	-2497
AAAGCAA	-2498
CCCATTT	-2499
CCTACAG	-2500
CTTTGAT	-2501
AACACC	-2502
CCGCCTG	-2503
ACAACAT	-2504
ACTGGAG	-2505
AAATAATG	-2506
CCTGTTG	-2507
AAAAGAAT	-2508
CGCAGTGG	-2509
ACATTGG	-2510
CAATATG	-2511
CTTTAAAA	-2512
CTATCTAT	-2513
CTCTATG	-2514
ACTTGTG	-2515
CTTGGAG	-2516
AGTTGGG	-2517
AATGTAT	-2518
CGTAT	-2519
CAAACTC	-2520
CTCTAAT	-2521
CCCCTTT	-2522
CTGCCCC	-2523
ATTTCTC	-2524
ATATTAT	-2525
AACAAAAT	-2526
CAATCAG	-2527
CTGTAAG	-2528
ACAGAGCAG	-2529
TGAGATT	-2530
GGGTT	-2531
ATTGAAG	-2532
CCATATT	-2533
CACCACT	-2534
ACATCAT	-2535
CATGCAG	-2536
AGAGATG	-2537
AAAATAAAAT	-2538
AGGAAAT	-2539
CAAATCC	-2540
ACTGATG	-2541
CTAGGGT	-2542
ATTGCAT	-2543
ATGGCTG	-2544
AAAACATT	-2545
ACCTATT	-2546
AAAGACTT	-2547
CTACCAG	-2548
AATTTCTT	-2549
CAAGCTCCG	-2550
ATACATAT	-2551
CCACCTT	-2552
CGTGAACC	-2553
ATGTTAG	-2554
AAAAAAAC	-2555
CTGGAGTGCAGTGG	-2556
CCCTCTG	-2557
CAACCTT	-2558
AACTGGT	-2559
CTTTTATT	-2560
CTTTTAAT	-2561
CCTGAAT	-2562
ACCTTTG	-2563
CTTGTTG	-2564
ACTTGAA	-2565
AGTCAGG	-2566
CTTTGGT	-2567
CCTCTAG	-2568
CCCAGTG	-2569
AACCATG	-2570
ACTGATT	-2571
CACGAGGTCAGGAGAT	-2572
CGCCCG	-2573
CATTCAAGT	-2574
CTAACAT	-2575
AAGCCAG	-2576
CCACCTC	-2577
ATTTTTTG	-2578
ATTTTGAG	-2579
CGGGAG	-2580
AGTGAGG	-2581
TGTTTTGTTT	-2582
AATTAATT	-2583
CTGGCAT	-2584
CTGCTC	-2585
CCTAAAG	-2586
AAAAATTAG	-2587
AAGAGTT	-2588
AGTTGTT	-2589
CCCCATG	-2590
CCGCC	-2591
CTTCAGT	-2592
ACCCATG	-2593
CAGAGGG	-2594
AACCTCC	-2595
AAAAAGTT	-2596
CATTTATT	-2597
AAGATGG	-2598
CTTAAAG	-2599
ATGGGAT	-2600
ATTTATTG	-2601
CCTGGTG	-2602
CAAATTTT	-2603
ACTAAAG	-2604
AAGAAGT	-2605
CTATAAAG	-2606
CTTGATG	-2607
ACCAGTT	-2608
CTTAAAT	-2609
CAAGATT	-2610
AAATATAT	-2611
AAACTTG	-2612
AAATGAAT	-2613
CTCACTGT	-2614
AAACACTG	-2615
ACAGCAT	-2616
ACAAAAATTAG	-2617
CTA	-2618
▁AGG	-2619
ACAGTGAG	-2620
CCACAAT	-2621
CGTGAT	-2622
AAAAATGG	-2623
CCCCAGT	-2624
AACATAT	-2625
CAGAATT	-2626
ATTTTTAT	-2627
AGGTAAT	-2628
CTGCATG	-2629
CTTTGCC	-2630
CGTGAGCCACTG	-2631
CCTGATG	-2632
ACCCCG	-2633
AAGTGTT	-2634
CTCAAGCAAT	-2635
ACTTGGT	-2636
ACTTTAT	-2637
CACATAC	-2638
CTCTCTCC	-2639
CAAACG	-2640
AAGGAGT	-2641
CTCGTG	-2642
AACGTT	-2643
TGTGATG	-2644
AAAATATTT	-2645
AGGTTGT	-2646
ACCAAAG	-2647
CACAAAC	-2648
NNNNN	-2649
TGATATT	-2650
CGGGTG	-2651
AGAAAATT	-2652
CCTCGT	-2653
CTTTAGG	-2654
CCGAGGCAGG	-2655
CTAGTTTT	-2656
AAAAAAAAG	-2657
CGGTTT	-2658
CTTGAATT	-2659
ACA	-2660
CAATAAG	-2661
CAGTCAT	-2662
ACTCAAT	-2663
CTCGAACTCCTGAC	-2664
AACCTGT	-2665
AAGTATG	-2666
CAGGAGT	-2667
CTCAGTTT	-2668
AGAACTT	-2669
NNNNNNN	-2670
ACATAGT	-2671
CAAGGAG	-2672
ATGTATTT	-2673
CCACTGT	-2674
CAAAATAT	-2675
ACTGCAT	-2676
CAGACT	-2677
AGAAACT	-2678
CTGCCAT	-2679
CTCCTAC	-2680
CATTTTTTT	-2681
AAGCG	-2682
CTCTTTGT	-2683
CCTACTT	-2684
AACCATT	-2685
AATGAAAA	-2686
AATTATAT	-2687
AGAACAT	-2688
CCTTTAT	-2689
ACAGAAAA	-2690
TGGTAGAG	-2691
▁AAT	-2692
▁TGG	-2693
AACAGGT	-2694
CAGTGGG	-2695
CTTCCAT	-2696
AAAGAAGG	-2697
CCTGTTTT	-2698
AAATATGT	-2699
GGGAG	-2700
CTGGGCATGGTGG	-2701
ACAGTTTT	-2702
CCAGGATGGTCTCGAT	-2703
AAGATAT	-2704
ACACACAT	-2705
CCTCCCACCTCAG	-2706
CTGATGG	-2707
CCTCCTCC	-2708
AGAGGTT	-2709
CTGACTG	-2710
CATAGTG	-2711
CAGTTAG	-2712
ACAAACT	-2713
ATTGGT	-2714
ACAATTTT	-2715
AACCAAT	-2716
NNN	-2717
ACCACG	-2718
AATGACT	-2719
CCTACTG	-2720
CTACATG	-2721
AAGTCC	-2722
CTGAGGTGGGAGG	-2723
ACACAAG	-2724
CAAGGTG	-2725
CTGTCTCT	-2726
CTTAGAG	-2727
ACAGCC	-2728
AGGTATT	-2729
CTGTAGG	-2730
CATTCCAG	-2731
CTGACC	-2732
AAAGTTG	-2733
CTGGAATG	-2734
CCTGGCCAACATGG	-2735
CCTCTCTG	-2736
TGTTCAT	-2737
TGGAAAG	-2738
CAGAGAT	-2739
ACCTGTG	-2740
ATAATTG	-2741
AGGGAGT	-2742
CTGAGCC	-2743
AATTAGG	-2744
AAGCAC	-2745
CAACCAG	-2746
ACACCAG	-2747
AGTTATT	-2748
CCAGGCATGGTGG	-2749
AACACG	-2750
CAAAATTT	-2751
AGGTTGCAG	-2752
CAAACAA	-2753
CCTGAGT	-2754
AAACCTT	-2755
▁TTTT	-2756
ACTAGAG	-2757
ACACATAT	-2758
CAGGGTG	-2759
ATGGCAT	-2760
ATAGATAG	-2761
ACTTGAT	-2762
CGGCG	-2763
TGGGAGT	-2764
TGAGTGG	-2765
CTACGT	-2766
ATCTGG	-2767
CCTTCCT	-2768
CTCCACAT	-2769
AAGGCAGG	-2770
AACTAGG	-2771
TGGGCG	-2772
CCAAAAG	-2773
CCAAATG	-2774
CAAATGGT	-2775
AAAATAAAT	-2776
ATTTTCAT	-2777
AATGTAG	-2778
CCAGAGT	-2779
CTGTATG	-2780
AAAAACAT	-2781
AAGAGGT	-2782
ATGTAGG	-2783
CCTTGAA	-2784
AATCATT	-2785
CAGTCTT	-2786
TGGTATT	-2787
CAGTAGG	-2788
ACGAT	-2789
CACCATTT	-2790
▁GTT	-2791
TGGAGTG	-2792
CAGGAGAT	-2793
CCTTATT	-2794
ATGGGTG	-2795
CAATTGT	-2796
CATCATG	-2797
CTTTCCTG	-2798
AAGGCTG	-2799
TGCCAGT	-2800
CCGGT	-2801
ACCTCAT	-2802
CCAATTT	-2803
AAAGCTT	-2804
TGGTAGG	-2805
ACTTCCT	-2806
AAATTAAT	-2807
AGACATT	-2808
CAAGACT	-2809
CTAGATG	-2810
ACCATTTT	-2811
TGAGATGG	-2812
▁ATT	-2813
AACGTG	-2814
CAACCTG	-2815
CCTGGGGG	-2816
TGGAAAA	-2817
ACCATTTG	-2818
CAAAAATG	-2819
AGAGAAT	-2820
ATCCAGT	-2821
CAACTGG	-2822
CATCCTG	-2823
CTTCCAC	-2824
CACTGGGG	-2825
AAGTGAG	-2826
TGGAGATTT	-2827
CCAGCTG	-2828
CAAGTGT	-2829
CCCTGCC	-2830
CTTTTGTT	-2831
AAACTAG	-2832
CTAGATT	-2833
CTCCTAT	-2834
ATTTAATT	-2835
CATGGGGG	-2836
▁CAG	-2837
ACCTTCC	-2838
CTTTCTTTT	-2839
CTCCCAGG	-2840
ACAGGTG	-2841
CTTTTTTTTT	-2842
AAAAAAGT	-2843
CTTATAT	-2844
AAGACTT	-2845
AAACCCT	-2846
TGGTTGT	-2847
CGGGGT	-2848
TGAACAT	-2849
CGTGAGCCACCG	-2850
CCGAGGTGGG	-2851
AATTTCAG	-2852
TGAGGCCTT	-2853
ACTCTTG	-2854
CTGTAGT	-2855
CATGTTG	-2856
AAGAGGG	-2857
ATGTCTTT	-2858
ATAGTT	-2859
CGGATCAC	-2860
CCTTGAT	-2861
CCTCCAC	-2862
CTTCAAT	-2863
ATTGAGT	-2864
AGGCAGG	-2865
CACCAAT	-2866
TGAAAATT	-2867
AACATTG	-2868
TGCCCGG	-2869
ACATATAT	-2870
CCGAGATTG	-2871
AAGCAAG	-2872
ATAAATTT	-2873
ATCCTT	-2874
ATCTTG	-2875
AGAAACTT	-2876
CTGGTTTT	-2877
AGTACAG	-2878
CTCTCCTG	-2879
ATTTTTAGTAGAG	-2880
ACCCACT	-2881
CAAAATGT	-2882
CACCCAT	-2883
AACTACT	-2884
CAACTTG	-2885
ATGTATGT	-2886
CCATAAT	-2887
CTCCCAC	-2888
CTCCTCTT	-2889
ATATGG	-2890
AAAAGCAG	-2891
TGCCATG	-2892
AATATCTT	-2893
ATAATTT	-2894
CTTTTCAT	-2895
CTGCCG	-2896
CCCTCTT	-2897
CCCCATT	-2898
AAGGCAT	-2899
AAAAAGAT	-2900
AAGCAGG	-2901
AAGAGAT	-2902
ACCTGGT	-2903
CTGGGCGTGGTGG	-2904
CTATCTT	-2905
TGGAGAG	-2906
CATTCCT	-2907
TGGGAAT	-2908
TGTTCAG	-2909
AATGGAAT	-2910
CAACAGT	-2911
ACAATTG	-2912
AATTCAAG	-2913
CCTCCCAAAG	-2914
ATCCTG	-2915
AACCTTG	-2916
CTGAGGCGGG	-2917
CGCCT	-2918
AAAAATTG	-2919
AGAAACTG	-2920
CAGGATT	-2921
ATTTGCATTT	-2922
CGGGGGG	-2923
ACCTAAG	-2924
CACCACCATG	-2925
AGGATTG	-2926
CTAGACAGAAG	-2927
CAACTGT	-2928
CTCCTCTG	-2929
AAGCAAT	-2930
ATTTCAC	-2931
ATGCTTT	-2932
ATTTAAAT	-2933
CCACTTT	-2934
ATAACAG	-2935
CTTCTAG	-2936
CAACCTCCACCTCC	-2937
ATAAAAT	-2938
CAGTATG	-2939
CTCTAAG	-2940
CATGCG	-2941
ACTATAG	-2942
ACAGAAAT	-2943
CGGAGCTTGCAGTGAG	-2944
ATACAGT	-2945
CAAAACAAAA	-2946
ATATCAT	-2947
AAACCAA	-2948
CGTGAA	-2949
CTTCCTTT	-2950
CGGCAG	-2951
CATTCAC	-2952
CGCCCAGG	-2953
ACCCTCC	-2954
ATCCATT	-2955
AAAAACTG	-2956
CCACCGTG	-2957
TGAAAT	-2958
AGGGAAGG	-2959
AACACTC	-2960
CCTGGGTGACAGAG	-2961
ACACCAT	-2962
CATGCAT	-2963
CGGAGGTTGCAGTGAG	-2964
TGTCCT	-2965
AGGGATT	-2966
AAATTTTTT	-2967
CCAGGCGTGGTGG	-2968
CAATAAAT	-2969
TGTGCTG	-2970
TGTTAAT	-2971
ATCCAG	-2972
CTGGGGTT	-2973
CTACCAT	-2974
CTTATTTT	-2975
ACTTCAA	-2976
AAACGGG	-2977
AAAAGATG	-2978
CCTCAAT	-2979
CTCCTCAG	-2980
CTGTCTCC	-2981
ACAGAAAG	-2982
CAGCCTG	-2983
AAACATAT	-2984
CCGCG	-2985
AGAACTG	-2986
ACTATTTT	-2987
ACACCTT	-2988
AGTATCTGG	-2989
▁TGT	-2990
CTCAAATT	-2991
ACATCTG	-2992
AAAATGGT	-2993
ACATAAG	-2994
CAGAGCAG	-2995
ATGTCTG	-2996
AGAAAAT	-2997
ATGTAGT	-2998
ATTTTTTTT	-2999
CCTAATG	-3000
CACCCGG	-3001
ACTGCTG	-3002
TGTCAC	-3003
CAGAGTTT	-3004
ATGGATGG	-3005
ACTCCTG	-3006
TGGGATG	-3007
ACTACTT	-3008
CCTACC	-3009
AGGTCAT	-3010
CCATTGG	-3011
CTAAAATG	-3012
CAAGAGT	-3013
AGGTTGAGG	-3014
TGTAGTT	-3015
AGGGCTG	-3016
ACACAAAA	-3017
CATTATTT	-3018
TGGGGTG	-3019
AATTTAAT	-3020
CTCAAACT	-3021
CTACAAT	-3022
ATGGAAAA	-3023
ACTAATG	-3024
ACACACAG	-3025
CACCTCGG	-3026
ATTTGTTTT	-3027
ATTGATG	-3028
CTTTCAA	-3029
CACAAGGT	-3030
TGGGATT	-3031
ATAGAGT	-3032
AAAGAATT	-3033
AGGTATAT	-3034
CACGGTGAAACC	-3035
CATTAGG	-3036
AAACACAG	-3037
CAAGAAAT	-3038
AAACCTG	-3039
CATTTGTT	-3040
CACAAGT	-3041
ACCACAT	-3042
CCAGATT	-3043
ATGTCC	-3044
CGAGAG	-3045
ATCAAT	-3046
CATCCTT	-3047
CTCAAAAG	-3048
TGGAAAT	-3049
TGTGAAT	-3050
AAAATTTTT	-3051
CACTCTT	-3052
CACTCTAG	-3053
CCTGGGTT	-3054
CTCTCTGT	-3055
ACTCTAT	-3056
CAGTGGT	-3057
CATTTTGT	-3058
ACACAAAT	-3059
CCTGATT	-3060
TGTGAAG	-3061
AACCCAGG	-3062
AAGGAGAG	-3063
AGTCCTT	-3064
AGAAACAG	-3065
CGCTGG	-3066
AAGGTTG	-3067
CCCTCAG	-3068
TGTTTAT	-3069
CCTGGTTT	-3070
CTCTGTGT	-3071
TGTTTTTTT	-3072
AGGTTTTT	-3073
ACAGTAG	-3074
ACTTTAG	-3075
TGTTCTC	-3076
CAGATTT	-3077
ATGGTTG	-3078
ACTACTG	-3079
CCACAAG	-3080
AAGTCTG	-3081
CTTTTTTTT	-3082
AATTGAAT	-3083
CAGAATG	-3084
CTGTGAAG	-3085
CACCCTT	-3086
TGTGTGTGT	-3087
CACCTGTAATCCCAG	-3088
ACCATAT	-3089
TGCCATT	-3090
CTGGCCTC	-3091
AATGGCGTGAACC	-3092
TGAAAATG	-3093
AATTTGTT	-3094
ATAGCAT	-3095
AATTAGT	-3096
AGGTCTT	-3097
CGTGGT	-3098
ACAAAATG	-3099
AGAGGG	-3100
AGGTTTG	-3101
AACAGTG	-3102
ATGAGAG	-3103
CACCTAG	-3104
CTTTCTCC	-3105
CCACACTG	-3106
CTTTAGT	-3107
CTGGGTTT	-3108
AAAGGTG	-3109
ATGTGAG	-3110
CCGCAG	-3111
CTCAACC	-3112
ACCACAC	-3113
CCTATAT	-3114
ATTTTAAAA	-3115
AACCTGGG	-3116
ATAATAG	-3117
AGTTAAT	-3118
CTTGCAT	-3119
CTTGAACTCCTGAC	-3120
CAGGTGT	-3121
AAATGAAG	-3122
AAATGCAAAT	-3123
ACTCTAG	-3124
CAAAAAAG	-3125
CTGAGATTG	-3126
ATAGAGG	-3127
CTACGG	-3128
ACCTATG	-3129
ACCAGGT	-3130
CATGAGT	-3131
CCAACAT	-3132
CCATCCAT	-3133
AATTAAAT	-3134
CTGGGATG	-3135
CAAAATGG	-3136
AATGGAATGG	-3137
ACTATTG	-3138
AACTCTC	-3139
ACTCCTT	-3140
TGTAAAT	-3141
AATCTGT	-3142
CAACATAG	-3143
CCTATTG	-3144
ATTTCCTG	-3145
ATTTCTTG	-3146
CCTAAGG	-3147
ATAAGG	-3148
CAGTGTG	-3149
ATAAACAG	-3150
ATCAAG	-3151
CTCAAACTCCTGAC	-3152
ATGCCCGG	-3153
ACAACTT	-3154
TGAGGAG	-3155
CCTAGTT	-3156
ATATTTTTT	-3157
CACTCCAGCCTGG	-3158
AAAATGTGG	-3159
CTCCTGACCTC	-3160
AAGTGAT	-3161
AGGAATG	-3162
ACATACAT	-3163
ACTTTCTT	-3164
ACAAAGGG	-3165
CATTCAA	-3166
TGGCAGG	-3167
AGACATG	-3168
ACCTGCC	-3169
CTGCGG	-3170
CCATGTG	-3171
ATTATTG	-3172
ATTTTGAT	-3173
CTGAGTTT	-3174
TTTTTTTTTTTTTTT	-3175
ATTTACT	-3176
CCACATTTT	-3177
AAGAAAAG	-3178
AAGAGAGG	-3179
CTTTTCTTT	-3180
AAGTAGT	-3181
CCTGCTT	-3182
ACCTTGTGAT	-3183
CCCCCAT	-3184
CCTATAATCCCAG	-3185
ATATACC	-3186
CTCTTAG	-3187
TGTCTGT	-3188
CTTTGTGG	-3189
CGAGAT	-3190
CTATTTTTT	-3191
CGACAG	-3192
AAATACAG	-3193
CAGAGTT	-3194
CCCCTGG	-3195
CTTGGTTT	-3196
AGCCATT	-3197
AAACAATT	-3198
AGTATTCC	-3199
CAAAGTTT	-3200
CAGCCAG	-3201
AAAAAAGG	-3202
ATATATGT	-3203
CTCCCATT	-3204
CTCATAC	-3205
AAGAGTTT	-3206
CCACCGCG	-3207
CCAACTT	-3208
AAAGAATG	-3209
ATGACAG	-3210
CTATTGG	-3211
CATTTTGG	-3212
CTGTGCC	-3213
TGGTTGG	-3214
CTAGTAG	-3215
CGTTGG	-3216
TGTATGT	-3217
AACAATTT	-3218
AAAACCT	-3219
ATTTGAT	-3220
AATATAAT	-3221
CAGCATT	-3222
AAAACAAG	-3223
CTCCTTCC	-3224
CTGGAGAG	-3225
CCCACAG	-3226
CTAGGATTACAGG	-3227
CCATCTCT	-3228
ATAACTT	-3229
CAATCAT	-3230
CAGATGG	-3231
CTTTGAGGCCT	-3232
TTTTGTTTT	-3233
AAGGCTT	-3234
TGAGACAGGGT	-3235
CAGCCTT	-3236
CCTGTAGT	-3237
AAATGATG	-3238
▁ATG	-3239
CTAACTT	-3240
ATATTAG	-3241
ATATAGT	-3242
CCTAGGG	-3243
ATGGTAG	-3244
CGCAC	-3245
CACCGTGTTAG	-3246
CCCAAGG	-3247
CTATAGT	-3248
▁AAG	-3249
CTTTGTGT	-3250
CAGCTCC	-3251
CCCTTCC	-3252
CTACAAG	-3253
CCTGCAT	-3254
CTGCTCTG	-3255
CAGGCAT	-3256
AATATGT	-3257
CTCTTTTTT	-3258
CGAGGG	-3259
CACTTAG	-3260
TGTTTGTG	-3261
CCAAGGT	-3262
AATCTTT	-3263
ACTTAGG	-3264
AAATGTTTT	-3265
AATGAATT	-3266
AACCAACC	-3267
ATTCCAG	-3268
CTAATTG	-3269
ATGTTAT	-3270
CAGAGATG	-3271
CTGTCTTT	-3272
CATCCATGT	-3273
AGTAGTT	-3274
AGTGTTTT	-3275
AATTAGAT	-3276
AAATCATG	-3277
TGAGTTTT	-3278
ACTTGCC	-3279
AAATCATT	-3280
CTAAATAT	-3281
AATCAAT	-3282
ACTATGG	-3283
AAATGTGT	-3284
AAGACAT	-3285
CATACTG	-3286
CCCTGAG	-3287
CTGGTTG	-3288
AATTCTTT	-3289
CAGAGTTGAA	-3290
CCTCAGTTT	-3291
AGGCG	-3292
ATCAGG	-3293
AGGAGTT	-3294
AAGATGT	-3295
AACTGCC	-3296
ACTACAT	-3297
AATCTAT	-3298
CCACTGG	-3299
TGGTGCATG	-3300
AAAAACTT	-3301
ATTTTATG	-3302
ACAAATGG	-3303
ACGTGT	-3304
CACTTGAGG	-3305
CATCCAG	-3306
ACACAGGG	-3307
AAGGGTG	-3308
CCCACTT	-3309
CAAGTTG	-3310
CAGCTGG	-3311
AATTCAA	-3312
AGGTGGG	-3313
ACTCACTG	-3314
CAAGTTTT	-3315
CAGATAT	-3316
CTACTTG	-3317
CAGGAAAC	-3318
ACAGCTG	-3319
AAATGGGG	-3320
AGTTCTT	-3321
ACACTTTT	-3322
AGAGGAG	-3323
CTCGGT	-3324
CAGGTTG	-3325
AATTGTT	-3326
CATCTGG	-3327
ATTTTTAG	-3328
CATGCCACTG	-3329
CTCTCTGG	-3330
ATACAAAAAATTAG	-3331
CCACATGG	-3332
CCAAGGCAGG	-3333
CCTTGAC	-3334
ATTTAAAG	-3335
CACCTGTAGTCCCAG	-3336
CTGAGGTT	-3337
CTATGTTT	-3338
AAGGTAG	-3339
CTATTAT	-3340
CCCTAA	-3341
AGGTCAAG	-3342
AGGCAA	-3343
ACACAGAG	-3344
CAATGGGG	-3345
CTACCTT	-3346
ATTTCTGT	-3347
▁GGT	-3348
AAAACTTT	-3349
CGTTTG	-3350
AGGGGTG	-3351
TGTGATT	-3352
AAAAGAAAG	-3353
CGCTTG	-3354
AGGTATG	-3355
AGGAGGG	-3356
CCTTCTTT	-3357
ACTGCTT	-3358
AAAAAGAA	-3359
AAATACAT	-3360
AAAATTGT	-3361
CTGATAT	-3362
ACATGAG	-3363
ACAAATAT	-3364
ATTTGAGG	-3365
CAGACAG	-3366
CAGCATG	-3367
AATTTTAG	-3368
TGAGACTCTGT	-3369
AGTCTTG	-3370
CAACCAT	-3371
AGATATG	-3372
CACTAAT	-3373
CTGTTAG	-3374
ATAAATT	-3375
CAACAAAA	-3376
AGTGAAG	-3377
AAACATGG	-3378
AGCCATG	-3379
CTCCAAT	-3380
AGAATCTGCAAGTGG	-3381
AATGTTTTT	-3382
AATGGTTT	-3383
TGATAAT	-3384
CCTGTGGT	-3385
AGGTAAG	-3386
ATAGTGT	-3387
ACTTAAG	-3388
CTGCCTC	-3389
AATATATAT	-3390
AAGTGATT	-3391
ACCATTG	-3392
ACCCCAC	-3393
CACCTAT	-3394
ATATTTGT	-3395
CGCAGG	-3396
CACGGT	-3397
TGAGTGT	-3398
ATTTGTGT	-3399
CACTATG	-3400
AAACATCTT	-3401
CAGAAGT	-3402
AAAATCTT	-3403
CTTTGAGGATTT	-3404
ACACTTG	-3405
CCTAAGT	-3406
ATAGCATT	-3407
AAAGACAT	-3408
ATTTGAAT	-3409
CCTCCAGG	-3410
AGTCATG	-3411
CCTTAAT	-3412
CGAGACTCCGT	-3413
AAAACATG	-3414
ATTTTTGG	-3415
AAGGTTTT	-3416
CCGTGT	-3417
CTTTGTTTT	-3418
ATTGGG	-3419
CCGCCCAC	-3420
TGCCCG	-3421
ACTTATG	-3422
CTATAAG	-3423
CCACCACGCCCGG	-3424
CATTTCTT	-3425
ATTTCTCC	-3426
CATGTTAG	-3427
CTTTCTCT	-3428
ATTGCTG	-3429
CCTAGAT	-3430
AGAAGTG	-3431
CCCTGTG	-3432
AGTGTGG	-3433
CTGGGTGTGGTGG	-3434
CTTGAGTT	-3435
TGGCCAGGCTGGT	-3436
ACTAAGT	-3437
ATATTTGGATAG	-3438
AGAATAG	-3439
CTCTTGTT	-3440
CAGCAAG	-3441
CGAAAC	-3442
CCATGTT	-3443
ACGTGTG	-3444
AATTCATT	-3445
CCTCTCTT	-3446
TGACGG	-3447
CTTCTTTT	-3448
ATGTGGG	-3449
AACCAAAA	-3450
AAAAGGGG	-3451
CATATTTT	-3452
CCTAGCC	-3453
CACACTC	-3454
CTGACAT	-3455
AGAAATGT	-3456
CACCATGTTGG	-3457
CTGCTTG	-3458
CACTTCAG	-3459
CTCGAG	-3460
AAGTTAG	-3461
CCCTTTG	-3462
AAAGCAGG	-3463
CACGCCACTG	-3464
CATTCTCAGAAACTT	-3465
CCCAGGT	-3466
CTCTAGT	-3467
AATTTTGG	-3468
CTATTGTT	-3469
AAAAATAAT	-3470
AGTGAAT	-3471
CTCCTTGG	-3472
CCCATGG	-3473
ATATAAG	-3474
ATGTGGT	-3475
TGGGTTG	-3476
AATGATTT	-3477
CTGAGATTACAGG	-3478
CTAGAGT	-3479
ATATATATATAT	-3480
AGTTTGAG	-3481
AGTTCAG	-3482
CTCACAA	-3483
CTTTCATT	-3484
CGTGTT	-3485
ATAAATGT	-3486
CAATAGG	-3487
CAAGACTCTGT	-3488
CTGGAGGG	-3489
ATCTAT	-3490
CAATGTTT	-3491
CAACCTC	-3492
CATCAGG	-3493
CGGCGG	-3494
ATACTG	-3495
CTCCTGCC	-3496
CTATGAG	-3497
AAATTTGT	-3498
CAACACT	-3499
CTCCACC	-3500
TGTGAGCCACTG	-3501
AAGTGGACATTTGGAG	-3502
AGACAAT	-3503
ATACAGG	-3504
AAC	-3505
CTAGGAG	-3506
CTGTCTGT	-3507
AAAAATATT	-3508
CCTCTAT	-3509
AACCAGT	-3510
ATTTTAAG	-3511
CCTGCCTG	-3512
ACTAAGG	-3513
AAACCAC	-3514
AACATAG	-3515
ATCTCT	-3516
TGGGTTTT	-3517
ATGTGAT	-3518
CATACAG	-3519
ATTAAAG	-3520
CCGCCG	-3521
AAACAATG	-3522
CTGGGATTATAGG	-3523
CATAATG	-3524
CAAGTGAT	-3525
TGTGGTG	-3526
TGAGAAAT	-3527
CATGCTT	-3528
CCATCTCC	-3529
ATTATGT	-3530
AAGTAAAT	-3531
TGCAGTG	-3532
CTGGGAAG	-3533
ATGCATT	-3534
ATTTACTT	-3535
AATTAGCCGGG	-3536
AAACACAT	-3537
AAAGAAAAT	-3538
AATCCAT	-3539
TGTAATT	-3540
AGTTTGAGACCAG	-3541
CCACCACACC	-3542
CCAAGGG	-3543
CGCCCAG	-3544
CAACCCC	-3545
CACCAGT	-3546
TGAGAGT	-3547
ATCTTTT	-3548
AGGGCAGG	-3549
AAATGAGG	-3550
CTCACCAC	-3551
CAGCCCC	-3552
TGGTGTT	-3553
AGGGTTG	-3554
TGCCAAG	-3555
CACTGTTT	-3556
CACACAA	-3557
ATGACTT	-3558
CCTTAGG	-3559
AGACAAG	-3560
CAGAGAGG	-3561
CTACAAAA	-3562
CTTGCTTT	-3563
ACTAGTT	-3564
ATGAAGG	-3565
ATGAGAT	-3566
AAAATGTG	-3567
ATAACAA	-3568
CCCTTGG	-3569
TGGCCAGG	-3570
AATATTG	-3571
AGACAGT	-3572
CATGTAG	-3573
CACTCTGT	-3574
TGAACAG	-3575
TGGCTTT	-3576
AGAAATGG	-3577
CTGATGT	-3578
CACCCCAG	-3579
CTTACTT	-3580
CGCCCC	-3581
CCTATGG	-3582
ACTCTTTT	-3583
ATTCAAT	-3584
CCCAAAG	-3585
ATTTTCAG	-3586
ACTGGTG	-3587
CTACAAAG	-3588
TGAGCAT	-3589
CACCACCACG	-3590
CCAAGATCG	-3591
AAAATAATT	-3592
CTCCAGAG	-3593
AGGATGG	-3594
AAGTAAAA	-3595
ACTTTTTTT	-3596
AAACTGTT	-3597
CCTACAT	-3598
CTGGGAT	-3599
CACTGCAG	-3600
CATGAGCCACTG	-3601
CACAGTTT	-3602
CGTTTTT	-3603
AATTTCAT	-3604
AAAAATAAAA	-3605
CTAGTGG	-3606
CTCACTTT	-3607
AAATAAATAAATAAAT	-3608
TGCCGG	-3609
ACAGGAT	-3610
AAAGGAAG	-3611
CACAGTGG	-3612
TGTCATT	-3613
CAAAACCAC	-3614
ATTTGCAT	-3615
CTGGGGGG	-3616
CTTGTAG	-3617
AGGGAAAG	-3618
ACATGTTT	-3619
ATGTGTGCGTT	-3620
CTACCTG	-3621
CTAGTTG	-3622
CCCACG	-3623
CCTAGTG	-3624
AATTTATTT	-3625
AAATGATT	-3626
TGGGCTT	-3627
CTCTGGGT	-3628
CGCGGTGGCTCACG	-3629
▁TTG	-3630
CAGGGAGG	-3631
AGCAGTTT	-3632
AGTTCAAGACCAG	-3633
TGTTGTTTT	-3634
AACCGG	-3635
AAATATTG	-3636
AATGAAAG	-3637
CAGTAGAG	-3638
ACCCCAA	-3639
CTATCAG	-3640
CTCATAA	-3641
CCTGTAG	-3642
CCTGTGTT	-3643
AGAAATTT	-3644
CAATAAAA	-3645
ATTAGAG	-3646
AGTACT	-3647
AAACACTT	-3648
AACCCAT	-3649
CATTAAG	-3650
ATAGTGG	-3651
AACGGG	-3652
CCACCACACCCAG	-3653
CTGTATTT	-3654
CGATGG	-3655
AAGTATTT	-3656
CTTTGTGATGTTTG	-3657
GGGTG	-3658
ATGCATG	-3659
CTGATTTT	-3660
ACCTAGT	-3661
AGCCACTG	-3662
TGGGAGGG	-3663
ATACAAAAT	-3664
CTTTGAA	-3665
ACCTTTTT	-3666
